<template>
  <div class="container mx-auto">
    <RuleHeader />

    <main class="p-8">
      <h2 class="text-4xl font-bold my-8">事前登録規約</h2>
      <div class="my-8 text-lg">
        <p>
          <!-- 株式会社〇〇（以下「当社」といいます。） -->
          Rshelf運営（以下「当運営」といいます。）
          が提供するReshelf（以下，「本サービス」といいます。）へ事前登録を希望される方は，この事前登録規約（以下，「本規約」といいます。）をよくお読みの上，同意される場合のみご登録してください。なお，本サービスに事前登録された方は，本規約に同意したものとみなします。
        </p>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第1条（適用）</h3>
          <p>
            本規約は，本サービスの事前登録者（以下，「事前登録者」といいます。）と当運営との間の本サービスに関わる一切の関係に適用されます。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第2条（個人情報の提供）</h3>
          <p>
            本サービスへの事前登録にあたり登録者の氏名や住所等を正確に提供して頂く必要がある場合，提供された内容の全部又は一部について，虚偽，誤記又は記載漏れがあった場合には，本サービスにて提供するクーポンや割引などの特典の対象外とさせて頂くことがあります。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">
            第3条（事前登録者の投稿やデータファイル）
          </h3>
          <ul class="list-disc pl-8 my-4">
            <li>
              事前登録者は，当運営及び当運営から本サービスを承継した第三者に対して，自らが本サービスを通じてアップロードした投稿やデータファイルについて使用，複製，配布，他言語への翻訳を含む派生著作物の作成，表示及び実行に関する全世界的，無償，非独占的，サブライセンス可能かつ譲渡可能なライセンスを付与し，著作者人格権を行使しないことに同意したことになります。
            </li>
            <li>
              事前登録者は，他の事前登録者がアップロードした投稿やデータファイルを商用利用することはできません。
            </li>
          </ul>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第4条（禁止事項）</h3>
          <p class="mb-4">
            本サービスの事前登録に際しては，以下の行為を禁止します。当運営は，事前登録者が以下に該当する行為を行ったと判断した場合には，事前に通知することなく，本サービスから当該事前登録者を対象外としたり、又はその投稿データを一次的に非掲載とし若しくは削除することがあります。
          </p>
          <ul class="list-disc pl-8 my-4">
            <li>本サービスの運営を妨げる行為</li>
            <li>本規約に違反する行為</li>
            <li>他人に迷惑，不利益，損害，または不快感を与える行為</li>
            <li>他人を誹謗中傷し，またはその名誉もしくは信用を害する行為</li>
            <li>他人の著作権その他の知的財産権を侵害する行為</li>
            <li>他人の財産，プライバシーもしくは肖像権を侵害する行為</li>
            <li>営利を目的とした情報提供，広告宣伝もしくは勧誘行為</li>
            <li>公序良俗に反する行為</li>
            <li>事前登録に使用するSNSの利用規約その他各規定に違反する行為</li>
            <li>その他当運営が相当でないと判断する行為</li>
          </ul>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">
            第5条（本サービスの提供の停止等）
          </h3>
          <ul class="list-disc pl-8 my-4">
            <li>
              当運営は，以下のいずれかの事由があると判断した場合，事前登録者に事前に通知することなく本サービスを中断または中止することがあります。
            </li>
            <ul class="list-disc pl-8 my-4">
              <li>
                本サービス実施にかかるコンピュータシステムの保守点検または更新を行う場合
              </li>
              <li>
                地震，落雷，火災，停電または天災などの不可抗力により，本サービスの実施が困難となった場合
              </li>
              <li>コンピュータまたは通信回線等が事故により停止した場合</li>
              <li>事前登録に使用するSNSのサービスが中断または中止した場合</li>
              <li>その他，当運営が本サービスの実施を困難と判断した場合</li>
            </ul>

            <li>
              当運営は，前項による本サービスの中断または中止により，事前登録者が被った不利益または損害について，一切の責任を負わないものとします。
            </li>
          </ul>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第6条（免責）</h3>
          <ul class="list-disc pl-8 my-4">
            <li>
              当運営は，本サービスに関連して生じた事前登録者の損害について，当運営の故意または重大な過失がない限り，一切の責任を負わないものとします。
            </li>
            <li>
              当運営は，本サービスに関連して生じた事前登録者間または事前登録者と第三者の間におけるトラブルについて一切の責任を負わないものとします。
            </li>
          </ul>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第7条（サービス内容の変更等）</h3>
          <p>
            当運営は，事前登録者に予告することなく，本サービスの内容の一部または全部を変更し，もしくは本サービスの提供を中止することがあります。当運営は，これによって事前登録者に生じた損害について一切の責任を負いません。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第8条（本規約の変更）</h3>
          <p>
            当運営は，必要と判断した場合には，事前登録者に予告することなく，本規約を変更することができるものとします。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第9条（個人情報の取扱い）</h3>
          <ul class="list-disc pl-8 my-4">
            <li>
              本サービスにあたってご提供いただいた個人情報は，以下の目的でのみ使用いたします。
            </li>

            <ul class="list-disc pl-8 my-4">
              <li>事前登録者への特典や賞品の発送</li>
              <li>上記に関する連絡</li>
              <li>
                商品やサービスの参考とするための個人を特定しない統計情報の形での利用
              </li>
            </ul>

            <li>
              本サービスにあたってご提供いただいた個人情報は，事前登録者ご本人の同意がある場合を除いて，第三者に提供されることはありません。ただし，法令の定めがある場合等，当運営
              <nuxt-link to="/privacy" class="primary">
                「プライバシーポリシー」
              </nuxt-link>
              にて定める事由がある場合を除きます。詳しくは当運営
              <nuxt-link to="/privacy" class="primary">
                「プライバシーポリシー」
              </nuxt-link>
              をご覧ください。
            </li>
          </ul>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第10条（通知または連絡）</h3>
          <p>
            当運営から事前登録者に対する通知または連絡は，当運営の定める方法で行うものとし，事前登録者のLINEIDやメールアドレスの不備等により通知または連絡が到達しなかった場合には，本サービスの対象外とさせて頂くことがあります。
          </p>
        </div>

        <div class="my-12">
          <h3 class="text-xl font-bold mb-2">第11条（準拠法と合意管轄）</h3>
          <p>
            当運営と事前登録者との間で、本規約に基づくまたはこれに関連する訴訟の必要が生じた場合、東京地方裁判所を第一審の専属的合意管轄裁判所とします。本規約に関する準拠法は、日本法とします。
          </p>
        </div>

        <div class="w-full flex justify-end">以上</div>
      </div>
    </main>

    <Footer />
  </div>
</template>
<script>
// layout
import RuleHeader from '~/components/layouts/header/RuleHeader'
import Footer from '~/components/layouts/Footer'

export default {
  components: {
    RuleHeader,
    Footer,
  },
  head: {
    title: 'Reshelf | 事前登録規約',
    meta: [
      {
        hid: '事前登録規約',
        name: '事前登録規約',
        content:
          'Reshelfの事前登録規約ページです。事前登録を希望される方に向けての規約を掲載しています。',
      },
    ],
  },
}
</script>
<style lang="scss" scoped>
main {
  @apply w-full h-full mx-auto flex flex-col items-center;
  max-width: 800px;
}
.primary {
  color: var(--primary);
}
</style>
